tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1559_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1559_H_
#define _PIC16LF1559_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define SSP1IF                        59
#define TXIF                          60
#define RCIF                          61
#define AD1IF                         62
#define ADIF                          63
#define TMR1GIF                       64
#define PIR2                          65
#define BCL1IF                        66
#define AD2IF                         67
#define TMR0                          68
#define TMR1L                         69
#define TMR1H                         70
#define T1CON                         71
#define TMR1ON                        72
#define nT1SYNC                       73
#define T1CKPS0                       74
#define T1CKPS                        75
#define T1CKPS1                       76
#define TMR1CS0                       77
#define TMR1CS                        78
#define TMR1CS1                       79
#define T1GCON                        80
#define T1GSS0                        81
#define T1GSS                         82
#define T1GSS1                        83
#define T1GVAL                        84
#define T1GGO_nDONE                   85
#define T1GCON_GO                     86
#define T1GSPM                        87
#define T1GTM                         88
#define T1GPOL                        89
#define TMR1GE                        90
#define TMR2                          91
#define PR2                           92
#define T2CON                         93
#define T2CKPS0                       94
#define T2CKPS                        95
#define T2CKPS1                       96
#define TMR2ON                        97
#define T2OUTPS0                      98
#define T2OUTPS                       99
#define T2OUTPS1                      100
#define T2OUTPS2                      101
#define T2OUTPS3                      102
#define TRISA                         103
#define TRISA0                        104
#define TRISA1                        105
#define TRISA2                        106
#define TRISA3                        107
#define TRISA4                        108
#define TRISA5                        109
#define TRISB                         110
#define TRISB4                        111
#define TRISB5                        112
#define TRISB6                        113
#define TRISB7                        114
#define TRISC                         115
#define TRISC0                        116
#define TRISC1                        117
#define TRISC2                        118
#define TRISC3                        119
#define TRISC4                        120
#define TRISC5                        121
#define TRISC6                        122
#define TRISC7                        123
#define PIE1                          124
#define TMR1IE                        125
#define TMR2IE                        126
#define SSP1IE                        127
#define TXIE                          128
#define RCIE                          129
#define AD1IE                         130
#define ADIE                          131
#define TMR1GIE                       132
#define PIE2                          133
#define BCL1IE                        134
#define AD2IE                         135
#define OPTION_REG                    136
#define PS                            137
#define PS0                           138
#define PS1                           139
#define PS2                           140
#define PSA                           141
#define T0SE                          142
#define TMR0SE                        143
#define T0CS                          144
#define TMR0CS                        145
#define INTEDG                        146
#define nWPUEN                        147
#define PCON                          148
#define nBOR                          149
#define nPOR                          150
#define nRI                           151
#define nRMCLR                        152
#define nRWDT                         153
#define STKUNF                        154
#define STKOVF                        155
#define WDTCON                        156
#define SWDTEN                        157
#define WDTPS                         158
#define WDTPS0                        159
#define WDTPS1                        160
#define WDTPS2                        161
#define WDTPS3                        162
#define WDTPS4                        163
#define OSCCON                        164
#define SCS0                          165
#define SCS                           166
#define SCS1                          167
#define IRCF                          168
#define IRCF0                         169
#define IRCF1                         170
#define IRCF2                         171
#define IRCF3                         172
#define SPLLEN                        173
#define OSCSTAT                       174
#define HFIOFS                        175
#define LFIOFR                        176
#define HFIOFR                        177
#define PLLSR                         178
#define ADRESL                        179
#define ADRESL_ADRESL                 180
#define ADRESH                        181
#define ADRESH_ADRESH                 182
#define ADCON0                        183
#define AD1ON                         184
#define ADCON0_ADON                   185
#define ADCON0_GO_nDONE               186
#define ADCON0_GO                     187
#define ADGO                          188
#define ADCON0_CHS                    189
#define ADCON0_CHS0                   190
#define ADCON0_CHS1                   191
#define ADCON0_CHS2                   192
#define ADCON0_CHS3                   193
#define ADCON0_CHS4                   194
#define ADCON1                        195
#define ADCON1_ADPREF                 196
#define ADCON1_ADPREF0                197
#define ADCON1_ADPREF1                198
#define ADCON1_GO_nDONE_ALL           199
#define ADCON1_GO_ALL                 200
#define ADCON1_ADCS                   201
#define ADCON1_ADFM                   202
#define ADCON2                        203
#define ADCON2_TRIGSEL0               204
#define ADCON2_TRIGSEL                205
#define ADCON2_TRIGSEL1               206
#define ADCON2_TRIGSEL2               207
#define LATA                          208
#define LATA0                         209
#define LATA1                         210
#define LATA2                         211
#define LATA4                         212
#define LATA5                         213
#define LATB                          214
#define LATB4                         215
#define LATB5                         216
#define LATB6                         217
#define LATB7                         218
#define LATC                          219
#define LATC0                         220
#define LATC1                         221
#define LATC2                         222
#define LATC3                         223
#define LATC4                         224
#define LATC5                         225
#define LATC6                         226
#define LATC7                         227
#define BORCON                        228
#define BORRDY                        229
#define BORFS                         230
#define SBOREN                        231
#define FVRCON                        232
#define ADFVR0                        233
#define ADFVR                         234
#define ADFVR1                        235
#define CDAFVR0                       236
#define CDAFVR1                       237
#define TSRNG                         238
#define TSEN                          239
#define FVRRDY                        240
#define FVREN                         241
#define APFCON                        242
#define GRDASEL                       243
#define GRDBSEL                       244
#define SDSEL                         245
#define SSSEL                         246
#define SDOSEL                        247
#define RXDTSEL                       248
#define ANSA0                         249
#define ANSELA                        250
#define ANSA1                         251
#define ANSA2                         252
#define ANSA4                         253
#define ANSA5                         254
#define ANSELB                        255
#define ANSB4                         256
#define ANSB5                         257
#define ANSB6                         258
#define ANSB7                         259
#define ANSC0                         260
#define ANSELC                        261
#define ANSC1                         262
#define ANSC2                         263
#define ANSC3                         264
#define ANSC4                         265
#define ANSC5                         266
#define ANSC6                         267
#define ANSC7                         268
#define PMADRL                        269
#define PMADRH                        270
#define PMDATL                        271
#define PMDATH                        272
#define PMCON1                        273
#define RD                            274
#define WR                            275
#define WREN                          276
#define WRERR                         277
#define FREE                          278
#define LWLO                          279
#define CFGS                          280
#define PMCON2                        281
#define RCREG                         282
#define TXREG                         283
#define SPBRGL                        284
#define SPBRGH                        285
#define RCSTA                         286
#define RX9D                          287
#define OERR                          288
#define FERR                          289
#define ADDEN                         290
#define CREN                          291
#define SREN                          292
#define RX9                           293
#define SPEN                          294
#define TXSTA                         295
#define TX9D                          296
#define TRMT                          297
#define BRGH                          298
#define SENDB                         299
#define SYNC                          300
#define TXEN                          301
#define TX9                           302
#define CSRC                          303
#define BAUDCON                       304
#define ABDEN                         305
#define WUE                           306
#define BRG16                         307
#define SCKP                          308
#define RCIDL                         309
#define ABDOVF                        310
#define WPUA0                         311
#define WPUA                          312
#define WPUA1                         313
#define WPUA2                         314
#define WPUA3                         315
#define WPUA4                         316
#define WPUA5                         317
#define WPUB                          318
#define WPUB4                         319
#define WPUB5                         320
#define WPUB6                         321
#define WPUB7                         322
#define SSP1BUF                       323
#define SSPBUF                        324
#define SSP1ADD                       325
#define ADD                           326
#define SSP1MSK                       327
#define MSK                           328
#define SSP1STAT                      329
#define BF                            330
#define UA                            331
#define R_nW                          332
#define S                             333
#define P                             334
#define D_nA                          335
#define CKE                           336
#define SMP                           337
#define SSP1CON1                      338
#define SSPM0                         339
#define SSPM                          340
#define SSPM1                         341
#define SSPM2                         342
#define SSPM3                         343
#define CKP                           344
#define SSPEN                         345
#define SSPOV                         346
#define WCOL                          347
#define SSP1CON2                      348
#define SEN                           349
#define RSEN                          350
#define PEN                           351
#define RCEN                          352
#define ACKEN                         353
#define ACKDT                         354
#define ACKSTAT                       355
#define GCEN                          356
#define SSP1CON3                      357
#define DHEN                          358
#define AHEN                          359
#define SBCDE                         360
#define SDAHT                         361
#define BOEN                          362
#define SCIE                          363
#define PCIE                          364
#define ACKTIM                        365
#define IOCAP                         366
#define IOCAP0                        367
#define IOCAP1                        368
#define IOCAP2                        369
#define IOCAP3                        370
#define IOCAP4                        371
#define IOCAP5                        372
#define IOCAN0                        373
#define IOCAN                         374
#define IOCAN1                        375
#define IOCAN2                        376
#define IOCAN3                        377
#define IOCAN4                        378
#define IOCAN5                        379
#define IOCAF0                        380
#define IOCAF                         381
#define IOCAF1                        382
#define IOCAF2                        383
#define IOCAF3                        384
#define IOCAF4                        385
#define IOCAF5                        386
#define IOCBP                         387
#define IOCBP4                        388
#define IOCBP5                        389
#define IOCBP6                        390
#define IOCBP7                        391
#define IOCBN                         392
#define IOCBN4                        393
#define IOCBN5                        394
#define IOCBN6                        395
#define IOCBN7                        396
#define IOCBF                         397
#define IOCBF4                        398
#define IOCBF5                        399
#define IOCBF6                        400
#define IOCBF7                        401
#define PWM1DCL                       402
#define PWM1DCL0                      403
#define PWM1DCL1                      404
#define PWM1DCH                       405
#define PWM1DCH0                      406
#define PWM1DCH1                      407
#define PWM1DCH2                      408
#define PWM1DCH3                      409
#define PWM1DCH4                      410
#define PWM1DCH5                      411
#define PWM1DCH6                      412
#define PWM1DCH7                      413
#define PWM1CON                       414
#define PWM1POL                       415
#define PWM1OUT                       416
#define PWM1OE                        417
#define PWM1EN                        418
#define PWM2DCL0                      419
#define PWM2DCL                       420
#define PWM2DCL1                      421
#define PWM2DCH0                      422
#define PWM2DCH                       423
#define PWM2DCH1                      424
#define PWM2DCH2                      425
#define PWM2DCH3                      426
#define PWM2DCH4                      427
#define PWM2DCH5                      428
#define PWM2DCH6                      429
#define PWM2DCH7                      430
#define PWM2CON                       431
#define PWM2POL                       432
#define PWM2OUT                       433
#define PWM2OE                        434
#define PWM2EN                        435
#define AD1CON0                       436
#define AD1CON0_ADON                  437
#define AD1CON0_GO                    438
#define GO_nDONE1                     439
#define AD1CON0_GO_nDONE              440
#define AD1CON0_CHS0                  441
#define AD1CON0_CHS                   442
#define AD1CON0_CHS1                  443
#define AD1CON0_CHS2                  444
#define AD1CON0_CHS3                  445
#define AD1CON0_CHS4                  446
#define ADCOMCON                      447
#define ADCOMCON_ADPREF               448
#define ADCOMCON_ADPREF0              449
#define ADCOMCON_ADPREF1              450
#define ADCOMCON_GO_nDONE_ALL         451
#define ADCOMCON_GO_ALL               452
#define ADCS0                         453
#define ADCOMCON_ADCS                 454
#define ADCS1                         455
#define ADCS2                         456
#define ADCOMCON_ADFM                 457
#define AD1CON2                       458
#define AD1CON2_TRIGSEL               459
#define AD1CON2_TRIGSEL0              460
#define AD1CON2_TRIGSEL1              461
#define AD1CON2_TRIGSEL2              462
#define AD1CON3                       463
#define AD1DSEN                       464
#define AD1CON3_ADDSEN                465
#define AD1IPEN                       466
#define AD1CON3_ADIPEN                467
#define AD1CON3_ADIPPOL               468
#define AD1IPPOL                      469
#define AD1EPPOL                      470
#define AD1CON3_ADEPPOL               471
#define ADSTAT                        472
#define AD1STG0                       473
#define ADSTG                         474
#define AD1STG                        475
#define AD1STG1                       476
#define AD1CONV                       477
#define ADCONV                        478
#define AD2STG0                       479
#define AD2STG                        480
#define AD2STG1                       481
#define AD2CONV                       482
#define AD1PRECON                     483
#define AD1PRECON_ADPRE               484
#define AD1PRECON_ADPRE0              485
#define AD1PRECON_ADPRE1              486
#define AD1PRECON_ADPRE2              487
#define AD1PRECON_ADPRE3              488
#define AD1PRECON_ADPRE4              489
#define AD1PRECON_ADPRE5              490
#define AD1PRECON_ADPRE6              491
#define AD1ACQCON                     492
#define AD1ACQCON_ADACQ0              493
#define AD1ACQCON_ADACQ               494
#define AD1ACQCON_ADACQ1              495
#define AD1ACQCON_ADACQ2              496
#define AD1ACQCON_ADACQ3              497
#define AD1ACQCON_ADACQ4              498
#define AD1ACQCON_ADACQ5              499
#define AD1ACQCON_ADACQ6              500
#define AD1GRD                        501
#define GRD1POL                       502
#define AD1GRD_GRDPOL                 503
#define AD1GRD_GRDAOE                 504
#define GRD1AOE                       505
#define AD1GRD_GRDBOE                 506
#define GRD1BOE                       507
#define AD1CAPCON                     508
#define AD1CAPCON_ADDCAP              509
#define ADD1CAP                       510
#define AD1CAPCON_ADDCAP0             511
#define AD1CAPCON_ADCAP               512
#define AD1CAPCON_ADDCAP1             513
#define AD1CAPCON_ADDCAP2             514
#define AD1CAPCON_ADDCAP3             515
#define AAD1RES0L                     516
#define AAD1RES0L_ADRESL              517
#define AAD1RES0H                     518
#define AAD1RES0H_ADRESH              519
#define AAD1RES1L                     520
#define AAD1RES1L_ADRESL              521
