tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1559_tdd.h
#define AAD1RES1H                     522
#define AAD1RES1H_ADRESH              523
#define AD1CH                         524
#define CH10                          525
#define CH11                          526
#define CH12                          527
#define CH13                          528
#define CH14                          529
#define CH15                          530
#define CH16                          531
#define AD2CON0                       532
#define AD2CON0_ADON                  533
#define GO_nDONE2                     534
#define AD2CON0_GO                    535
#define AD2CON0_GO_nDONE              536
#define AD2CON0_CHS                   537
#define AD2CON0_CHS0                  538
#define AD2CON0_CHS1                  539
#define AD2CON0_CHS2                  540
#define AD2CON0_CHS3                  541
#define AD2CON0_CHS4                  542
#define AD2CON2                       543
#define AD2CON2_TRIGSEL0              544
#define AD2CON2_TRIGSEL               545
#define AD2CON2_TRIGSEL1              546
#define AD2CON2_TRIGSEL2              547
#define AD2CON3                       548
#define AD2CON3_ADDSEN                549
#define AD2DSEN                       550
#define AD2IPEN                       551
#define AD2CON3_ADIPEN                552
#define AD2IPPOL                      553
#define AD2CON3_ADIPPOL               554
#define AD2CON3_ADEPPOL               555
#define AD2EPPOL                      556
#define AD2PRECON                     557
#define AD2PRECON_ADPRE0              558
#define AD2PRECON_ADPRE               559
#define AD2PRECON_ADPRE1              560
#define AD2PRECON_ADPRE2              561
#define AD2PRECON_ADPRE3              562
#define AD2PRECON_ADPRE4              563
#define AD2PRECON_ADPRE5              564
#define AD2PRECON_ADPRE6              565
#define AD2ACQCON                     566
#define AD2ACQCON_ADACQ0              567
#define AD2ACQCON_ADACQ               568
#define AD2ACQCON_ADACQ1              569
#define AD2ACQCON_ADACQ2              570
#define AD2ACQCON_ADACQ3              571
#define AD2ACQCON_ADACQ4              572
#define AD2ACQCON_ADACQ5              573
#define AD2ACQCON_ADACQ6              574
#define AD2GRD                        575
#define AD2GRD_GRDPOL                 576
#define GRD2POL                       577
#define AD2GRD_GRDAOE                 578
#define GRD2AOE                       579
#define GRD2BOE                       580
#define AD2GRD_GRDBOE                 581
#define AD2CAPCON                     582
#define AD2CAPCON_ADDCAP              583
#define AD2CAPCON_ADCAP               584
#define ADD2CAP                       585
#define AD2CAPCON_ADDCAP0             586
#define AD2CAPCON_ADDCAP1             587
#define AD2CAPCON_ADDCAP2             588
#define AD2CAPCON_ADDCAP3             589
#define AAD2RES0L                     590
#define AAD2RES0L_ADRESL              591
#define AAD2RES0H                     592
#define AAD2RES0H_ADRESH              593
#define AAD2RES1L                     594
#define AAD2RES1L_ADRESL              595
#define AAD2RES1H                     596
#define AAD2RES1H_ADRESH              597
#define AD2CH                         598
#define CH20                          599
#define CH21                          600
#define CH22                          601
#define CH23                          602
#define CH24                          603
#define CH25                          604
#define CH26                          605
#define ICDIO                         606
#define TRIS_ICDCLK                   607
#define TRIS_ICDDAT                   608
#define LAT_ICDCLK                    609
#define LAT_ICDDAT                    610
#define PORT_ICDCLK                   611
#define PORT_ICDDAT                   612
#define ICDCON0                       613
#define RSTVEC                        614
#define DBGINEX                       615
#define SSTEP                         616
#define FREEZ                         617
#define INBUG                         618
#define ICDSTAT                       619
#define USRHLTF                       620
#define TRP0HLTF                      621
#define TRP1HLTF                      622
#define ICDINSTL                      623
#define DBGIN0                        624
#define DBGIN1                        625
#define DBGIN2                        626
#define DBGIN3                        627
#define DBGIN4                        628
#define DBGIN5                        629
#define DBGIN6                        630
#define DBGIN7                        631
#define ICDINSTH                      632
#define DBGIN8                        633
#define DBGIN9                        634
#define DBGIN10                       635
#define DBGIN11                       636
#define DBGIN12                       637
#define DBGIN13                       638
#define ICDBK0CON                     639
#define BKHLT                         640
#define BKEN                          641
#define ICDBK0L                       642
#define BKA0                          643
#define BKA1                          644
#define BKA2                          645
#define BKA3                          646
#define BKA4                          647
#define BKA5                          648
#define BKA6                          649
#define BKA7                          650
#define ICDBK0H                       651
#define BKA8                          652
#define BKA9                          653
#define BKA10                         654
#define BKA11                         655
#define BKA12                         656
#define BKA13                         657
#define BKA14                         658
#define BSRICDSHAD                    659
#define BSR_ICDSHAD                   660
#define STATUS_SHAD                   661
#define C_SHAD                        662
#define DC_SHAD                       663
#define Z_SHAD                        664
#define WREG_SHAD                     665
#define BSR_SHAD                      666
#define PCLATH_SHAD                   667
#define FSR0L_SHAD                    668
#define FSR0H_SHAD                    669
#define FSR1L_SHAD                    670
#define FSR1H_SHAD                    671
#define STKPTR                        672
#define TOSL                          673
#define TOSH                          674

#endif // _PIC16LF1559_H_
